package model;

public enum bookGenre {// перечисление книг по жанрам, которые есть в магазине
	//Тип enum — то специальный тип данных, который позволяет переменной быть набором 
	//предопределенных констант. Другими словами, он позволяет создать 
	//переменную, которая может принимать несколько значений (каждое из значений, 
	//объявленных в самом перечислении, и ничего более).
 
	Art, //художественная литература
	Psychology,//книги по психологии
	Programming//книги по программированию
	
}
